In [1]:
import numpy as np
import pandas as pd

In [2]:
my_dictionary={"James":[40,30,np.nan],"Kirk":[20,np.nan,50],"Lars":[30,50,40]}

In [3]:
my_data_frame=pd.DataFrame(my_dictionary)

In [4]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [5]:
my_data_frame.dropna()

   James  Kirk  Lars
0   40.0  20.0    30

In [6]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [7]:
my_data_frame.dropna(axis=1)

   Lars
0    30
1    50
2    40

In [10]:
my_new_dictionary={"James":[40,30,np.nan],"Kirk":[20,np.nan,50],"Lars":[30,50,40],"Rob":[45,np.nan,np.nan]}

In [11]:
my_new_data_frame=pd.DataFrame(my_new_dictionary)

In [12]:
my_new_data_frame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [34]:
my_new_data_frame.dropna(axis=1,thresh=2)

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [35]:
my_new_data_frame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [36]:
my_new_data_frame.fillna(20)

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0  20.0    50  20.0
2   20.0  50.0    40  20.0